[
  "Even though Mathare was filled with garbage, struggle, and danger; happiness could be found in the very young. This is one of the first photographs I took in the slum, on December 11, 2007.",
  "There were many family businesses in Mathare. Here, a boy is working alongside an elder. Looking into his eyes, I wonder what he thinks of this mzungu taking his picture, escorted by one of the slum's most respected people. (Mzungu is slang for white person.)",
  "Garbage piled everywhere. The stench was horrendous. But still, sometimes one could find useful items. I'm not sure what this boy was looking for, but I hope he found some shoes.",
  "There were children everywhere in Mathare during the day. Sober adults and young adults would work during the day, leaving many of the dusty paths and alleyways to the kids. I told this boy I really liked his shirt, and he smiled.",
  "Most of the youngest kids liked getting their picture taken, and sometimes it was a challenge to photograph anything else. Photo-bombs were frustrating in the moment, but in the years that followed, they became some of the best memories I have from the trip.",
  "The best roofs were made of corrugated metal. From a distance, clotheslines could be seen among the dust and rust. Clean clothes were as much a necessity for work outside the slum as they were a luxury, inside.",
  "When we visited in 2007, there were about a half a million people living in the Mathare slum, which the U.N. described as the most brutal slum in the world.",
  "This boy and his younger siblings (in the next photo) were happy to pose for a picture while we set up an interview with their father.",
  "These two kids and their older brother (in the previous photo) were happy to pose for a picture while we set up an interview with their father.",
  "This was one of the slum's most respected elders. He worked hard to improve the lives of those living in the community.",
  "There were some small farms near the Mathare river - the heart of the slum. Besides vermin, ducks were the most common animals.",
  "This is the Mathare river.",
  "Two boys dump waste into the river. That pipe is a sewer. That goat in the bottom left corner just finished taking a drink.",
  "These sleepy goats lived up the hill from the river. They were treated very well, and had this old concrete structure to climb up on.",
  "Nothing made sense there. I believe that is a chicken or duck bone, caught in a spider's web, outside someone's house.",
  "This kid wouldn't get out of the frame! I think he left with three or four polaroid pictures of himself. I doubt he still has them, but I hope they brought him some joy.",
  "Runoff/open sewer heading to the river.",
  "This image was taken in the local school's playground, and that girl was very happy to be there.",
  "Fresh water hydrants were available at the road. As soon as kids could carry water, they were often given that chore to help the family.",
  "Brewing changaa, an intoxicating, toxic, and addictive drink that was prevalent in the slum, requires a lot of water.",
  "Spices for sale at a roadside shop.",
  "The spice seller tries to stay cool.",
  "A makeshift bridge over the ditch along the roadside.",
  "Trash piled in many places. Organic material was picked through by various animals including goats, fowl, rodents, and insects.",
  "Ducks in garbage.",
  "Roadside ditch.",
  "Passed out person along the road, probably drunk or high from changaa.",
  "Football is a popular activity in the slum. The Mathare United Football Club competes in the Kenyan Premier League, and they won the title in 2008. This boy of course is not on the professional team, but I'm sure he and his friends were very excited to have their hometown take the championship.",
  "Nothing made sense there. I watched this scene from across the road. The boy darting in front of the moving truck did not get hit, and the drunk or high man on the ground was moved by passers by so the truck didn't run him over, either.",
  "Some young people from the slum joined the local youth group to help the next generation of kids and the adults struggling there. They were inspiring.",
  "Sitting on a rock, in her Sunday best, waiting for church.",
  "Magnetic tape, probably from a VCR cassette, becomes an object of interest for a girl in the school's playground.",
  "Passed out person along the road, probably drunk or high from changaa. The three young men are waiting to catch a ride on one of the independent buses.",
  "Not everyone is fortunate enough to 'escape' life in the slum. Some that have, stayed nearby and made it their life to improve the situation for others.",
  "Tusker is a Kenyan beer. The bottlecaps make good - and replaceable - washers.",
  "An open sewer. I'm sorry if it grosses you out; it was much more gross in person, and it was a part of life there.",
  "Charcoal for sale. Most homes and businesses used charcoal for heating and cooking. At night, there was smoke everywhere.",
  "Alleyway between some of the nicer houses in the slum. These once had a concrete pad and a walkway between them.",
  "Passed out person along the road, probably drunk or high from changaa. In this part of Mathare, vendors sell stews and offer other services like haircuts.",
  "Goats grazing along the very edge of Mathare. Some nice housing, outside of the slum, can be seen in the top-right. I bet that many who live there feel very fortunate.",
  "Drainage from the water hydrant dumps into the roadside ditches, where sometimes children play and wash while waiting for access. The very desperate sometimes collect this water instead of waiting in line.",
  "One of the working roadside hydrants. When we were there, only a few were operational, serving about a half million people. There were always lines.",
  "This woman was a volunteer who worked with people with HIV in the slums.",
  "Man trying to cross the road. Most of the traffic was brightly colored independently-operated buses that blasted music fitting their 'brand.'",
  "Man trying to cross the road. Most of the traffic was brightly colored independently-operated buses that blasted music fitting their 'brand.'",
  "Man trying to cross the road. Most of the traffic was brightly colored independently-operated buses that blasted music fitting their 'brand.'",
  "Man trying to cross the road. Most of the traffic was brightly colored independently-operated buses that blasted music fitting their 'brand.'",
  "Farms were common along some stretches of the Mathare river, giving the animals access to the water. The girl in the foreground is hauling fresh water from the road.",
  "View from a bridge of a man and the Mathare river. He was just walking along it - I'm not sure if he was looking for something.",
  "From the outside, looking into and past Mathare. Almost all the clothes the kids wear were donated, and they are passed down as the kids grow.",
  "A toy made from wire, rubber-bands, bottle caps, and a bit of earth. Note, the front tires were steered by the handle.",
  "Football is a popular activity in the slum. These kids are playing with a ball made from plastic bags.",
  "Changaa brewing slash distilling in 55-gallon drums. Operations like this were illegal but that really didn't mean anything in the slum. They used the river to cool the condenser coils.",
  "…I remember her name, and I wonder if she remembers mine.",
  "…I wonder where this girl and her sibling are now, fifteen years later as of 2022.",
  "Mzungu is slang for white person, but the word once meant 'wandering spirits.' I have wandered far from who and where I was back then, and I hope this kid has, too.",
  "A home with young children. The pink fabric swayed slightly in the breeze, and it was beautiful.",
  "Death and suffering was everywhere. Glancing down and seeing something dead under foot was a shockingly common experience.",
  "Sewage from second floor tenants running down the wall. Years of it ate through the metal of the window frame beneath it and dissolved the mortar between the blocks.",
  "Drainage from the water hydrant dumps into the roadside ditches, where sometimes children play and wash while waiting for access. The very desperate sometimes collect this water instead of waiting in line.",
  "He wasn't proud of his job in the slum but he felt blessed to have it.",
  "Babies were a common sight in the slum, and they were frequently being cared for by their older sisters. Their brother here was very excited to make faces at the camera.",
  "This man's job was to carry water from the hydrants at the road down to the changaa brewers by the river. There are few roads that carts can use in the slum; most are too narrow or too uneven.",
  "This woman worked in a salon. In this photo, her customer is braiding a friend's hair (outside of the frame). Many people commute from the slum to other parts of Nairobi to find work.",
  "This disabled woman was crossing the street, heading into Mathare.",
  "These three kids were on their way to fetch water. All of them wore smiles and flip-flops that were too big. They were having fun with each other, laughing as they approached.",
  "Passed out person along the road, probably drunk or high from changaa. We had some changaa tested in a lab; it was toxic and would cause blindness and death with repeated exposure. Toxic additives were frequently added to batches to make their effect stronger.",
  "Kids at a recently-repaired hydrant on the far outskirts of the slum, where the water was just turned back on. They probably will carry the jug of water between them on their way back into Mathare."
]
